app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos"
---
  def index
    @videos = Video.all

SELECT "videos".* FROM "videos"
---
  def show_playlist
    videos = Video.all

INSERT INTO "videos" ("created_at", "file", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-12-17 06:49:07.257612"], ["file", "720-She_Was_Pretty_Episode_13_Nontondrama.tv.mp4"], ["name", "she was pretty"], ["updated_at", "2015-12-17 06:49:07.257612"]]
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save

DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 1]]
---
  def destroy
    @video.destroy

SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_video
      @video = Video.find(params[:id])